// LAB-6.2(2).cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
// LAB_06_2(2).cpp
// Сушинський Ігор
// Лабораторна робота № 6.2
// Опрацювання одновимірних масивів ітераційними та рекурсивними способами.
// Варіант 28
// Рекурсивний спосіб

#include <iostream>

using namespace std;

int Count(int* a, int n, int i) // функція обчислення к-ті елементів
{
    if (i == n)
        return 0; // умова закінчення рекурсивного процесу
    else
    {
        if ((a[i] % 2) != 0)
            return Count(a, n, i + 1) + 1; // додати 1 до результату
        else
            return Count(a, n, i + 1);
    }
}

int main()
{
	const int n = 32; // поточна розмірність масиву n = 1..32
	int a[n]; // заданий масив

	cout << "Count = " << Count(a, n, 0);

	return 0;
}